[
    {
        "date": "2024-06-16",
        "entry": "Feeling a bit homesick today. Missing my family and my hometown. I called Mum, but we ended up arguing about my decision to move to Berlin. It’s tough sometimes. On the bright side, I met some interesting people in my music course. Played the violin for a bit, and it calmed me down. I read a novel in the evening, which helped me relax."
    },
    {
        "date": "2024-06-23",
        "entry": "Had a good day today. Spent some time with Mike and Hans; we grabbed a pizza. I even found a place that serves pineapple pizza, my favorite! Feeling more settled in Berlin now. Practiced violin in the afternoon and felt I made some real progress. Read a bit before bed and called Mum, no arguments this time."
    },
    {
        "date": "2024-06-30",
        "entry": "Feeling nervous today. Thinking about my exams and how much I need to study. Played the violin, but it didn’t go well, which made me more anxious. Called Mum and we had a nice chat, which made me feel better. Finished the day with a good book."
    },
    {
        "date": "2024-07-07",
        "entry": "Had a lovely day today. The weather was beautiful, and I spent some time outdoors. Practiced violin and it went really well. Met some new people from my course, and we had a great time. Feeling more at home here. Ended the day with a call to Mum and some reading."
    },
    {
        "date": "2024-07-14",
        "entry": "Feeling a bit down today. Really missing home and my old friends. Practiced violin, but it didn’t help much. Read a novel in the evening to try and distract myself. Called Mum, but we argued again. It’s hard being so far away."
    },
    {
        "date": "2024-07-21",
        "entry": "Had a fantastic day today. Spent time with Mike and Hans, and we explored some parts of Berlin I hadn’t seen before. Ate pineapple pizza, which was a real treat. Practiced violin and felt like I made good progress. Feeling hopeful about my future here."
    },
    {
        "date": "2024-07-28",
        "entry": "Feeling very nervous today. Exams are getting closer, and I don’t feel ready. Practiced violin, but it was frustrating. Tried to read in the evening to calm down. Called Mum for some comfort, and we had a good chat. Trying to stay positive."
    },
    {
        "date": "2024-08-04",
        "entry": "Had a pretty good day. Met some new friends from my course, and we had a fun time. Practiced violin and felt more confident today. Feeling more connected to Berlin. Read a novel in the evening and called Mum, no arguments this time."
    },
    {
        "date": "2024-08-11",
        "entry": "Feeling very homesick today. Missing my family and my old life. Practiced violin, but it didn’t go well. Called Mum and we argued, which made me feel worse. Tried to read in the evening to take my mind off things."
    },
    {
        "date": "2024-08-18",
        "entry": "Had a lovely day. Spent time with Mike and Hans, and we had a great time exploring Berlin. Ate pineapple pizza, which always cheers me up. Practiced violin and felt like I made progress. Feeling more settled here."
    },
    {
        "date": "2024-08-25",
        "entry": "Feeling anxious today. Exams are coming up, and I’m really worried about them. Practiced violin, but it didn’t go well. Tried to read in the evening to calm down. Called Mum, and we had a supportive chat, which helped."
    },
    {
        "date": "2024-09-01",
        "entry": "Feeling hopeful today. Had a good practice session with the violin. Met some new friends from my course and had a great time. Feeling more at home in Berlin. Read a novel in the evening and called Mum, no arguments."
    },
    {
        "date": "2024-09-08",
        "entry": "Feeling a bit down today. Missing home and my old friends. Practiced violin, but it didn’t help much. Called Mum and we argued, which made me feel worse. Tried to read in the evening to distract myself."
    },
    {
        "date": "2024-09-15",
        "entry": "Had a good day today. Spent time with Mike and Hans, and we had a fun day out. Ate pineapple pizza, which was a real treat. Practiced violin and felt like I made good progress. Feeling hopeful about my future here."
    },
    {
        "date": "2024-09-22",
        "entry": "Feeling very nervous today. Exams are getting closer, and I don’t feel ready. Practiced violin, but it was frustrating. Tried to read in the evening to calm down. Called Mum for some comfort, and we had a good chat."
    },
    {
        "date": "2024-09-29",
        "entry": "Feeling hopeful today. Had a good practice session with the violin. Met some new friends from my course and had a great time. Feeling more at home in Berlin. Read a novel in the evening and called Mum, no arguments."
    },
    {
        "date": "2024-10-06",
        "entry": "Feeling very anxious today. Exams are just around the corner, and I’m really worried. Practiced violin, but it didn’t go well. Tried to read in the evening to calm down. Called Mum, and we had a supportive chat."
    },
    {
        "date": "2024-10-13",
        "entry": "Feeling a bit homesick today. Missing my family and my old life. Practiced violin, but it didn’t help much. Called Mum and we argued, which made me feel worse. Tried to read in the evening to take my mind off things."
    },
    {
        "date": "2024-10-20",
        "entry": "Had a great day. Spent time with Mike and Hans, and we explored Berlin together. Ate pineapple pizza, which always cheers me up. Practiced violin and felt more confident today. Feeling more connected to Berlin."
    },
    {
        "date": "2024-10-27",
        "entry": "Feeling very nervous today. Exams are getting closer, and I’m really worried. Practiced violin, but it didn’t go well. Tried to read in the evening to calm down. Called Mum for some comfort, and we had a good chat."
    },
    {
        "date": "2024-11-03",
        "entry": "Feeling hopeful today. Had a good practice session with the violin. Met some new friends from my course and had a great time. Feeling more at home in Berlin. Read a novel in the evening and called Mum, no arguments."
    },
    {
        "date": "2024-11-10",
        "entry": "Feeling very anxious today. Exams are just around the corner, and I’m really worried. Practiced violin, but it didn’t go well. Tried to read in the evening to calm down. Called Mum, and we had a supportive chat."
    },
    {
        "date": "2024-11-17",
        "entry": "Feeling very homesick today. Missing my family and my old life. Practiced violin, but it didn’t help much. Called Mum and we argued, which made me feel worse. Tried to read in the evening to take my mind off things."
    },
    {
        "date": "2024-11-24",
        "entry": "Feeling better today. Spent time with Mike and Hans, and we had a fun day out. Ate pineapple pizza, which was a real treat. Practiced violin and felt like I made good progress. Feeling hopeful about my future here."
    },
    {
        "date": "2024-12-01",
        "entry": "Feeling very nervous today. Exams are getting closer, and I’m really worried. Practiced violin, but it didn’t go well. Tried to read in the evening to calm down. Called Mum for some comfort, and we had a good chat."
    },
    {
        "date": "2024-12-08",
        "entry": "Feeling hopeful today. Had a good practice session with the violin. Met some new friends from my course and had a great time. Feeling more at home in Berlin. Read a novel in the evening and called Mum, no arguments."
    },
    {
        "date": "2024-12-15",
        "entry": "Feeling very anxious today. Exams are just around the corner, and I’m really worried. Practiced violin, but it didn’t go well. Tried to read in the evening to calm down. Called Mum, and we had a supportive chat."
    },
    {
        "date": "2024-12-22",
        "entry": "Feeling very homesick today. Missing my family and my old life. Practiced violin, but it didn’t help much.
    }
]